<?php
/* Страница администратора для отображения данных о всем множестве объектов недвижимости, выделенных по некоторому признаку, например, все объекты, у которых назначен показ */

// Стартуем сессию с пользователем - сделать доступными переменные сессии
session_start();

// Подключаем нужные модели и представления
require_once $_SERVER['DOCUMENT_ROOT'] . '/models/DBconnect.php';
require_once $_SERVER['DOCUMENT_ROOT'] . '/models/GlobFunc.php';
require_once $_SERVER['DOCUMENT_ROOT'] . '/models/Logger.php';
require_once $_SERVER['DOCUMENT_ROOT'] . '/models/User.php';
require_once $_SERVER['DOCUMENT_ROOT'] . '/models/UserIncoming.php';
require_once $_SERVER['DOCUMENT_ROOT'] . '/models/CollectionProperty.php';
require_once $_SERVER['DOCUMENT_ROOT'] . '/views/View.php';

// Удалось ли подключиться к БД?
if (DBconnect::get() == FALSE) die('Ошибка подключения к базе данных (. Попробуйте зайти к нам немного позже.');

// Инициализируем модель для запросившего страницу пользователя
$userIncoming = new UserIncoming();

// Уточняем - имеет ли пользователь права админа.
$isAdmin = $userIncoming->isAdmin();

/*************************************************************************************
 * Проверяем - может ли данный пользователь просматривать данную страницу
 ************************************************************************************/

// Если пользователь не авторизирован, то пересылаем юзера на страницу авторизации
if (!$userIncoming->login()) {
	header('Location: login.php');
	exit();
}

// Если пользователь не является администратором, то доступ к странице ему запрещен - разавторизуем его и перекинем на главную (в идеале нужно перекидывать на login.php)
// Кроме того, проверяем, что у данного администратора есть право на поиск пользователей и вход в их Личные кабинеты
if (!$isAdmin['searchUser']) {
	header('Location: out.php');
	exit();
}

/*************************************************************************************
 * ПОЛУЧИМ GET ПАРАМЕТРЫ
 * Для защиты от XSS атаки и для использования в коде более простого имени для переменной
 ************************************************************************************/

// Команда админа
$action = "";
if (isset($_GET['action'])) $action = htmlspecialchars($_GET['action'], ENT_QUOTES);

/********************************************************************************
 * ИНИЦИАЛИЗИРУЕМ МОДЕЛЬ ДЛЯ КОЛЛЕКЦИИ ОБЪЕКТОВ НЕДВИЖИМОСТИ
 *******************************************************************************/

$collectionProperty = new CollectionProperty();

/********************************************************************************
 * ВСЕ ОБЪЕКТЫ НЕДВИЖИМОСТИ, ПО КОТОРЫМ НАЗНАЧЕН ПРОСМОТР (в порядке возрастания даты/времени показа)
 *******************************************************************************/

if ($action == "allWithEarliestDate") {
	$collectionProperty->buildAllWithEarliestDate();
	$strHeaderOfPage = "Все объекты с назначенной датой просмотра";
}

/********************************************************************************
 * ВСЕ СНЯТЫЕ С ПУБЛИКАЦИИ ОБЪЕКТЫ НЕДВИЖИМОСТИ, ПО КОТОРЫМ ЕСТЬ ЗАЯВКИ НА ПРОСМОТР (статус = Назначен просмотр)
 *******************************************************************************/

if ($action == "allRemovedWithRequestsToView") {
	$collectionProperty->buildAllUnpublishedWithRequestToView();
	$strHeaderOfPage = "Снятые с публикации объекты, по которым остались активные заявки на просмотр";
}

/********************************************************************************
 * ФОРМИРОВАНИЕ ПРЕДСТАВЛЕНИЯ (View)
 *******************************************************************************/

// Инициализируем используемые в шаблоне(ах) переменные
$allPropertiesCharacteristic = $collectionProperty->getAllPropertiesCharacteristic();
//$strHeaderOfPage

// Подсоединяем нужный основной шаблон
require $_SERVER['DOCUMENT_ROOT'] . "/templates/adminTemplates/templ_adminAllProperties.php";

/********************************************************************************
 * Закрываем соединение с БД
 *******************************************************************************/

DBconnect::closeConnectToDB();