<div id="getOwnerContactsDialog" title="Получить контакты собственника">

    <div style="text-align: left; margin: 10px 0 10px 0;">
        Для получения контактов собственника необходимо приобрести премиум-доступ
    </div>

    <div style="margin: 0 auto 1em auto; text-align: center;">
        <?php
        require $websiteRoot . "/templates/templ_paymentButtons.php";
        ?>
    </div>

    <div class="localHeader">
        Дополнительные преимущества премиум-доступа:
    </div>
    <ul class="benefits">
        <li>
            Автоматический подбор вариантов недвижимости
        </li>
        <li>
            Sms + email оповещение о новых подходящих под условия поиска объектах
        </li>
        <li>
            Избранные объявления (добавление/удаление/просмотр)
        </li>
        <li>
            Автоматическое применение условий поиска при авторизации на сайте
        </li>
        <!--<li>
            Бланки необходимых документов и разъяснения по ним (договор аренды, лист расчетов с
            собственником, расписка о получении оплаты...)
        </li>-->
        <li>
            Техническая поддержка и консультирование по работе сайта
        </li>
    </ul>

</div>