<div id="signUpToViewDialog" title="Записаться на просмотр">

    <span>
        Для отправки заявки на просмотр, необходимо <a href="registration.php?typeTenant=TRUE" class="button">Зарегистрироваться</a>
    </span>

    <div class="localHeader">Регистрация позволит:</div>
    <ul class="benefits" style="text-align: left;">
        <li>
            Записаться на просмотр любой недвижимости
        </li>
        <li>
            Получать уведомления о появлении подходящих вариантов недвижимости
        </li>
        <li>
            Добавлять объявления в избранные и в любой момент просматривать их
        </li>
        <li>
            Не указывать повторно условия поиска - портал запомнит
        </li>
    </ul>

</div>